In [2]:
import pandas as pd

In [4]:
pd.__version__

'1.4.2'

## 文件的读取和写入
### 文件读取

In [5]:
df_csv = pd.read_csv("./data/my_csv.csv")

In [6]:
df_csv

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

In [7]:
df_txt = pd.read_table("./data/my_table.txt")

In [8]:
df_txt

   col1 col2  col3             col4
0     2    a   1.4   apple 2020/1/1
1     3    b   3.4  banana 2020/1/2
2     6    c   2.5  orange 2020/1/5
3     5    d   3.2   lemon 2020/1/7

In [10]:
df_excel = pd.read_excel("./data/my_excel.xlsx")

In [11]:
df_excel

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

常用的公共参数，`header=None`表示第一行不作为列名，`index_col`表示把某一列或几列作为索引，
`usecols`表示读取列的集合，默认读取所有的列，`parse_dates`表示需要转化为时间的列，`nrows`表示读取的数据行数。上面这些参数在上述的三个函数里都可以使用。

In [12]:
pd.read_table("./data/my_table.txt", header=None)
# 注意到第一行变了

      0     1     2                3
0  col1  col2  col3             col4
1     2     a   1.4   apple 2020/1/1
2     3     b   3.4  banana 2020/1/2
3     6     c   2.5  orange 2020/1/5
4     5     d   3.2   lemon 2020/1/7

In [13]:
pd.read_csv("./data/my_csv.csv", index_col=["col1","col2"])
# 注意到col1和col2被加粗了

           col3    col4      col5
col1 col2
2    a      1.4   apple  2020/1/1
3    b      3.4  banana  2020/1/2
6    c      2.5  orange  2020/1/5
5    d      3.2   lemon  2020/1/7

In [14]:
pd.read_excel("./data/my_excel.xlsx", usecols=["col1", "col2"])

   col1 col2
0     2    a
1     3    b
2     6    c
3     5    d

In [15]:
pd.read_csv("data/my_csv.csv", parse_dates=["col5"])
# 注意到第5列的时间格式变了

   col1 col2  col3    col4       col5
0     2    a   1.4   apple 2020-01-01
1     3    b   3.4  banana 2020-01-02
2     6    c   2.5  orange 2020-01-05
3     5    d   3.2   lemon 2020-01-07

In [16]:
pd.read_excel("./data/my_excel.xlsx", nrows=2)

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2

在读取`txt`文件时，经常遇到分隔符非空格的情况，`read_table`有一个分割参数`sep`，它使得用户可以自定义分割符号，进行`txt`数据的读取。例如，下面的读取的表以`||||`为分割：

In [17]:
pd.read_table("./data/my_table_special_sep.txt")

              col1 |||| col2
0  TS |||| This is an apple.
1    GQ |||| My name is Bob.
2         WT |||| Well done!
3    PT |||| May I help you?

上面的结果显然不是理想的，这时可以使用sep，同时需要指定引擎为python

In [18]:
pd.read_table("./data/my_table_special_sep.txt", sep="\|\|\|\|",engine="python")

  col1                 col2
0   TS    This is an apple.
1   GQ      My name is Bob.
2   WT           Well done!
3   PT      May I help you?

在使用`read_table`的时候需要注意，参数`sep`中使用的是正则表达式，因此需要对`|`进行转义变成`\|`，否则无法读取到正确的结果。

### 数据写入

一般在数据写入中，最常用的操作是把index设置为False，特别当索引没有特殊意义的时候，这样的行为能把索引在保存的时候去除。

In [22]:
# 准备欲保存的数据
pd_csv = pd.read_csv("./data/my_csv.csv")
pd_excel = pd.read_excel("./data/my_excel.xlsx")
pd_txt = pd.read_table("./data/my_table.txt")

In [21]:
# 保存数据
df_csv.to_csv("./data/my_csv_saved.csv", index=False)
df_excel.to_excel("./data/my_excel_saved.xlsx", index=False)

pandas中没有定义to_table函数，但是to_csv可以保存为txt文件，并且允许自定义分隔符，常用制表符\t分割：

In [23]:
df_txt.to_csv("./data/my_table_saved.txt", index=False, sep="\t")

如果想要把表格快速转换为markdown和latex语言，可以使用to_markdown和to_latex函数，此处需要安装tabulate包。

In [26]:
print(df_csv.to_markdown())

|    |   col1 | col2   |   col3 | col4   | col5     |
|---:|-------:|:-------|-------:|:-------|:---------|
|  0 |      2 | a      |    1.4 | apple  | 2020/1/1 |
|  1 |      3 | b      |    3.4 | banana | 2020/1/2 |
|  2 |      6 | c      |    2.5 | orange | 2020/1/5 |
|  3 |      5 | d      |    3.2 | lemon  | 2020/1/7 |

In [27]:
print(df_csv.to_latex())

\begin{tabular}{lrlrll}
\toprule
{} &  col1 & col2 &  col3 &    col4 &      col5 \\
\midrule
0 &     2 &    a &   1.4 &   apple &  2020/1/1 \\
1 &     3 &    b &   3.4 &  banana &  2020/1/2 \\
2 &     6 &    c &   2.5 &  orange &  2020/1/5 \\
3 &     5 &    d &   3.2 &   lemon &  2020/1/7 \\
\bottomrule
\end{tabular}

C:\Users\17761\AppData\Local\Temp\ipykernel_20600\2725033129.py:1: FutureWarning: In future versions `DataFrame.to_latex` is expected to utilise the base implementation of `Styler.to_latex` for formatting and rendering. The arguments signature may therefore change. It is recommended instead to use `DataFrame.style.to_latex` which also contains additional functionality.
  print(df_csv.to_latex())

## 基本数据结构
`pandas`中具有两种基本的数据存储结构，存储一维`values`的`Series`和存储二维`values`的`DataFrame`，在这两种结构上定义了很多的属性和方法。

### Series
`Series`一般由四个部分组成，分别是序列的值`data`、索引`index`、存储类型`dtype`、序列的名字`name`。其中，索引也可以指定它的名字，默认为空。

In [28]:
s = pd.Series(data = [100, 'a', {'dic1':5}],
              index = pd.Index(['id1', 20, 'third']), 
              name="my_idx")

In [44]:
# 可以看到index是行索引
s

id1              100
20                 a
third    {'dic1': 5}
Name: my_idx, dtype: object

`object`代表了一种混合类型，正如上面的例子中存储了整数、字符串以及`Python`的字典数据结构。此外，目前`pandas`把纯字符串序列也默认认为是一种`object`类型的序列，但它也可以用`string`类型存储

获取上述属性

In [31]:
s.values

array([100, 'a', {'dic1': 5}], dtype=object)

In [33]:
s.index

Index(['id1', 20, 'third'], dtype='object')

如果想要取出单个索引对应的值，可以通过[index_item]可以取出

In [42]:
s.index[0],s.index[1],s.index[2]

('id1', 20, 'third')

In [35]:
s.dtype

dtype('O')

In [37]:
s.name

'my_idx'

利用.shape可以获取序列的长度

In [43]:
s.shape

(3,)

### DataFrame
`DataFrame`在`Series`的基础上增加了**列索引**

一个数据框可以由二维的`data`与行列索引来构造

In [45]:
# data shape(3,4)--(列,行)
data = [[1, 'a', 1.2], [2, 'b', 2.2], [3, 'c', 3.2],[4, 'd', 4.2]]
df = pd.DataFrame(data=data, 
                  index=["row_%d"%i for i in range(4)], 
                  columns=['col_0', 'col_1', 'col_2'])

In [46]:
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2
row_3      4     d    4.2

但一般而言，更多的时候会采用从列索引名到数据的映射来构造数据框，同时再加上行索引

In [47]:
data = {'col_0':[1,2,3], 'col_1':list("abc"), 'col_2':[1.2,2.2,3.2], "col_3":list("ABC")}
df = pd.DataFrame(data=data, index=["row_%d"%i for i in range(3)])

In [48]:
df

       col_0 col_1  col_2 col_3
row_0      1     a    1.2     A
row_1      2     b    2.2     B
row_2      3     c    3.2     C

由于这种映射关系，在DataFrame中可以用[col_name]与[col_list]来取出相应的列与由多个列组成的表，结果分别为Series和DataFrame

In [50]:
# 根据列名取出第一列-传入col_name
df["col_0"]

row_0    1
row_1    2
row_2    3
Name: col_0, dtype: int64

In [52]:
# 根据列名取出第一列和第三列-传入col_list
df[["col_0", "col_2"]]

       col_0  col_2
row_0      1    1.2
row_1      2    2.2
row_2      3    3.2

获取属性

In [53]:
data = {'col_0':[1,2,3], 'col_1':list("abc"), 'col_2':[1.2,2.2,3.2], "col_3":list("ABC")}
df = pd.DataFrame(data=data, index=["row_%d"%i for i in range(3)])

In [55]:
df.values

array([[1, 'a', 1.2, 'A'],
       [2, 'b', 2.2, 'B'],
       [3, 'c', 3.2, 'C']], dtype=object)

In [57]:
# 取行索引
df.index

Index(['row_0', 'row_1', 'row_2'], dtype='object')

In [59]:
# 取列索引
df.columns

Index(['col_0', 'col_1', 'col_2', 'col_3'], dtype='object')

In [61]:
df.dtypes# 返回的是值为相应列数据类型的Series

col_0      int64
col_1     object
col_2    float64
col_3     object
dtype: object

In [63]:
df.shape

(3, 4)

## DataFrame操作

**转置**

In [65]:
data = {'col_0':[1,2,3], 'col_1':list("abc"), 'col_2':[1.2,2.2,3.2], "col_3":list("ABC")}
df = pd.DataFrame(data=data, index=["row_%d"%i for i in range(3)])
df.shape

(3, 4)

In [69]:
transpose_df = df.T
transpose_df

      row_0 row_1 row_2
col_0     1     2     3
col_1     a     b     c
col_2   1.2   2.2   3.2
col_3     A     B     C

In [71]:
transpose_df.shape

(4, 3)

## 汇总函数

In [72]:
# 使用一份learn_pandas.csv的虚拟数据集，它记录了四所学校学生的体测个人信息
df = pd.read_csv("./data/learn_pandas.csv")

In [74]:
# 查看列索引
df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer',
       'Test_Number', 'Test_Date', 'Time_Record'],
      dtype='object')

上述列名依次代表学校、年级、姓名、性别、身高、体重、是否为转系生、体测场次、测试时间、1000米成绩，本章只需使用其中的前七列

In [76]:
df = df[df.columns[:7]]

head, tail函数分别表示返回表或者序列的前n行和后n行，其中n默认为5：

In [78]:
df.head()

                          School      Grade  ... Weight Transfer
0  Shanghai Jiao Tong University   Freshman  ...   46.0        N
1              Peking University   Freshman  ...   70.0        N
2  Shanghai Jiao Tong University     Senior  ...   89.0        N
3               Fudan University  Sophomore  ...   41.0        N
4               Fudan University  Sophomore  ...   74.0        N

[5 rows x 7 columns]

In [80]:
df.tail(3)

                            School      Grade  ... Weight Transfer
197  Shanghai Jiao Tong University     Senior  ...   45.0        N
198  Shanghai Jiao Tong University     Senior  ...   71.0        N
199            Tsinghua University  Sophomore  ...   51.0        N

[3 rows x 7 columns]

info, describe分别返回表的信息概况和表中数值列对应的主要统计量

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   School    200 non-null    object
 1   Grade     200 non-null    object
 2   Name      200 non-null    object
 3   Gender    200 non-null    object
 4   Height    183 non-null    float64
 5   Weight    189 non-null    float64
 6   Transfer  188 non-null    object
dtypes: float64(2), object(5)
memory usage: 11.1+ KB

In [83]:
df.describe()

           Height      Weight
count  183.000000  189.000000
mean   163.218033   55.015873
std      8.608879   12.824294
min    145.400000   34.000000
25%    157.150000   46.000000
50%    161.900000   51.000000
75%    167.500000   65.000000
max    193.900000   89.000000

`info, describe`只能实现较少信息的展示，如果想要对一份数据集进行全面且有效的观察，特别是在列较多的情况下，推荐使用[pandas-profiling](https://pandas-profiling.github.io/pandas-profiling/docs/)包

## 特征统计函数(聚合函数)

聚合函数-操作后返回的是标量

In [84]:
# 使用一份learn_pandas.csv的虚拟数据集，它记录了四所学校学生的体测个人信息
df = pd.read_csv("./data/learn_pandas.csv")
# 只使用前7列
df = df[df.columns[:7]]

In [85]:
df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer'], dtype='object')

选出身高和体重列

In [86]:
df_demo = df[["Height", "Weight"]]

In [88]:
df_demo

     Height  Weight
0     158.9    46.0
1     166.5    70.0
2     188.9    89.0
3       NaN    41.0
4     174.0    74.0
..      ...     ...
195   153.9    46.0
196   160.9    50.0
197   153.9    45.0
198   175.3    71.0
199   155.7    51.0

[200 rows x 2 columns]

In [91]:
df_demo.mean(), df_demo.max()

(Height    163.218033
 Weight     55.015873
 dtype: float64,
 Height    193.9
 Weight     89.0
 dtype: float64)

`quantile, count, idxmax`这三个函数，它们分别返回的是分位数、非缺失值个数、最大值对应的索引：

In [93]:
df_demo.quantile(0.75)

Height    167.5
Weight     65.0
Name: 0.75, dtype: float64

In [95]:
df_demo.count()

Height    183
Weight    189
dtype: int64

In [97]:
df_demo.idxmax()

Height    193
Weight      2
dtype: int64

指定公告参数axis对不同轴进行聚合:默认为0代表逐列聚合，如果设置为1则表示逐行聚合

In [100]:
df_demo.mean(axis=0)

Height    163.218033
Weight     55.015873
dtype: float64

## 常用函数

### 唯一值函数
对序列使用`unique`和`nunique`可以分别得到其唯一值组成的列表和唯一值的个数

In [101]:
# 使用一份learn_pandas.csv的虚拟数据集，它记录了四所学校学生的体测个人信息
df = pd.read_csv("./data/learn_pandas.csv")
# 只使用前7列
df = df[df.columns[:7]]

In [102]:
df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer'], dtype='object')

In [104]:
df["School"].unique()

array(['Shanghai Jiao Tong University', 'Peking University',
       'Fudan University', 'Tsinghua University'], dtype=object)

In [105]:
df["School"].nunique()

4

`value_counts`可以得到唯一值和其对应出现的频数：

In [107]:
df["School"].value_counts()

Tsinghua University              69
Shanghai Jiao Tong University    57
Fudan University                 40
Peking University                34
Name: School, dtype: int64

如果想要观察<span class="mark">多个列组合</span>的唯一值，可以使用`drop_duplicates`。其中的关键参数是`keep`，默认值`first`表示每个组合保留第一次出现的所在行，`last`表示保留最后一次出现的所在行，`False`表示把所有重复组合所在的行剔除。

In [111]:
df["Gender"].unique()

array(['Female', 'Male'], dtype=object)

In [112]:
df["Transfer"].unique()

array(['N', nan, 'Y'], dtype=object)

In [113]:
df["Name"].unique()

array(['Gaopeng Yang', 'Changqiang You', 'Mei Sun', 'Xiaojuan Sun',
       'Gaojuan You', 'Xiaoli Qian', 'Qiang Chu', 'Gaoqiang Qian',
       'Changli Zhang', 'Juan Xu', 'Xiaopeng Zhou', 'Xiaoquan Lv',
       'Peng You', 'Yanfeng Qian', 'Xiaomei Zhou', 'Changqiang Yang',
       'Xiaoqiang Qin', 'Peng Wang', 'Xiaofeng Sun', 'Changjuan You',
       'Xiaopeng Shen', 'Changqiang Sun', 'Qiang Zheng', 'Chunmei You',
       'Xiaopeng Chu', 'Yanli You', 'Qiang Sun', 'Gaoqiang Qin',
       'Changmei Xu', 'Changli Lv', 'Feng Zheng', 'Gaopeng Shi',
       'Yanjuan Han', 'Li Wu', 'Gaoli Zhao', 'Xiaojuan Qin',
       'Xiaoquan Zhang', 'Qiang Han', 'Chengpeng Zheng', 'Li Wang',
       'Chunqiang Chu', 'Mei Zhang', 'Gaoli Feng', 'Yanqiang Feng',
       'Quan Chu', 'Feng Zhou', 'Peng Wu', 'Mei Xu', 'Gaomei Lv',
       'Xiaoli Wang', 'Chengquan Chu', 'Chunli Lv', 'Chengli You',
       'Xiaojuan Chu', 'Chengquan Zhang', 'Qiang Lv', 'Changquan Chu',
       'Gaoli Xu', 'Yanpeng Lv', 'Xiaopeng Qin', 'Xiaoli Xu',
       'Gaofeng Zhao', 'Yanmei Yang', 'Chengpeng Zhou', 'Gaoquan Sun',
       'Chengqiang Lv', 'Chunquan Xu', 'Yanquan Wang', 'Feng Han',
       'Gaoquan Zhou', 'Feng Wang', 'Yanli Qin', 'Qiang You',
       'Yanquan Lv', 'Gaopeng Qin', 'Li Xu', 'Changmei Sun',
       'Yanli Zhang', 'Changfeng Lv', 'Yanjuan Lv', 'Li Chu', 'Feng Yang',
       'Xiaopeng Han', 'Gaojuan Zhao', 'Gaoqiang Zhou', 'Yanfeng Han',
       'Juan Zhao', 'Feng Zhao', 'Yanli Wang', 'Changmei Feng',
       'Changpeng Zhao', 'Xiaofeng Shi', 'Xiaoli Zhou', 'Chengli Zhao',
       'Mei Chen', 'Xiaopeng Lv', 'Qiang Shi', 'Xiaojuan Zhao',
       'Yanqiang Xu', 'Chunpeng Lv', 'Xiaomei Shi', 'Gaoquan Xu',
       'Chunjuan Xu', 'Changjuan Xu', 'Xiaopeng Zhao', 'Gaofeng Sun',
       'Chunli Zhao', 'Peng Zhang', 'Peng Han', 'Xiaoquan Sun',
       'Chunpeng Shi', 'Juan You', 'Changquan Han', 'Xiaofeng You',
       'Juan Zhang', 'Mei Feng', 'Chengpeng Qian', 'Chunpeng Qian',
       'Gaojuan Qin', 'Changqiang Qian', 'Li Lv', 'Chengquan Shi',
       'Xiaojuan Qian', 'Qiang Zhou', 'Qiang Zhang', 'Chunmei Shi',
       'Xiaoli Chu', 'Quan Xu', 'Gaoquan Chu', 'Xiaomei Yang',
       'Xiaofeng Qian', 'Chengpeng You', 'Feng Qian', 'Chengli Sun',
       'Changmei Lv', 'Yanpeng Han', 'Chunmei Han', 'Juan Qin',
       'Xiaoli Lv', 'Chengqiang Zhang', 'Chengpeng Zhao', 'Chunfeng Zhao',
       'Quan Qian', 'Chengjuan Zhang', 'Gaoquan Shen', 'Qiang Wang',
       'Xiaopeng Qian', 'Xiaoqiang Feng', 'Gaoli Wu', 'Chengquan Qin',
       'Li Sun', 'Xiaofeng Zhang', 'Quan Zhao', 'Gaojuan Qian',
       'Xiaopeng Sun', 'Li Qin', 'Mei Zheng', 'Yanjuan You',
       'Xiaoqiang Qian', 'Xiaofeng Zhao', 'Qiang Feng', 'Chunmei Wang',
       'Yanjuan Zhao', 'Chunjuan Zhang', 'Changli Qin', 'Gaojuan Wang',
       'Yanmei Qian', 'Li Zhao', 'Chengqiang Chu', 'Chengmei Shen'],
      dtype=object)

In [118]:
# keep，默认值first表示每个组合保留第一次出现的所在行
df_demo = df[['Gender','Transfer','Name']]
df_demo.drop_duplicates(['Name', 'Gender'])

     Gender Transfer            Name
0    Female        N    Gaopeng Yang
1      Male        N  Changqiang You
2      Male        N         Mei Sun
3    Female        N    Xiaojuan Sun
4      Male        N     Gaojuan You
..      ...      ...             ...
194  Female      NaN     Yanmei Qian
196  Female        N         Li Zhao
197  Female        N  Chengqiang Chu
198    Male        N   Chengmei Shen
199    Male        N     Chunpeng Lv

[181 rows x 3 columns]

In [117]:
# last表示保留最后一次出现的所在行
df_demo.drop_duplicates(['Name', 'Gender'], keep="last")

     Gender Transfer            Name
0    Female        N    Gaopeng Yang
1      Male        N  Changqiang You
2      Male        N         Mei Sun
4      Male        N     Gaojuan You
5    Female        N     Xiaoli Qian
..      ...      ...             ...
195  Female        N    Xiaojuan Sun
196  Female        N         Li Zhao
197  Female        N  Chengqiang Chu
198    Male        N   Chengmei Shen
199    Male        N     Chunpeng Lv

[181 rows x 3 columns]

In [116]:
# False表示把所有重复组合所在的行剔除
df_demo.drop_duplicates(['Name', 'Gender'], keep=False)

     Gender Transfer            Name
0    Female        N    Gaopeng Yang
1      Male        N  Changqiang You
2      Male        N         Mei Sun
4      Male        N     Gaojuan You
5    Female        N     Xiaoli Qian
..      ...      ...             ...
194  Female      NaN     Yanmei Qian
196  Female        N         Li Zhao
197  Female        N  Chengqiang Chu
198    Male        N   Chengmei Shen
199    Male        N     Chunpeng Lv

[164 rows x 3 columns]

In [120]:
# 在Series上也可以使用
df["School"].drop_duplicates()

0    Shanghai Jiao Tong University
1                Peking University
3                 Fudan University
5              Tsinghua University
Name: School, dtype: object

此外，`duplicated`和`drop_duplicates`的功能类似，但前者返回了是否为唯一值的布尔列表，其`keep`参数与后者一致。其返回的序列，把重复元素设为`True`，否则为`False`。 `drop_duplicates`等价于把`duplicated`为`True`的对应行剔除。

In [122]:
df_demo.duplicated(['Name', 'Gender'])# 为True的是Name和Gender都一样的重复行

0      False
1      False
2      False
3      False
4      False
       ...
195     True
196    False
197    False
198    False
199    False
Length: 200, dtype: bool

In [123]:
# 在Series上也可以使用
df["School"].duplicated()

0      False
1      False
2       True
3      False
4       True
       ...
195     True
196     True
197     True
198     True
199     True
Name: School, Length: 200, dtype: bool

### 替换函数

映射替换（`replace`方法、`str.replace`方法`cat.codes`方法）、逻辑替换、数值替换

替换操作是针对某一个列进行的，因此下面的例子都以`Series`举例

#### 映射替换

In [124]:
# 使用一份learn_pandas.csv的虚拟数据集，它记录了四所学校学生的体测个人信息
df = pd.read_csv("./data/learn_pandas.csv")
# 只使用前7列
df = df[df.columns[:7]]

In [126]:
df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer'], dtype='object')

**replace**

在replace中，可以通过字典构造，或者传入两个列表来进行替换

In [127]:
# 通过字典构造
df["Gender"].replace({"Female":0, "Male":1}).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [129]:
# 传入两个列表
df["Gender"].replace(["Female", "Male"],[0,1]).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

方向替换，指定method参数为ffill则为用前面一个最近的未被替换的值进行替换，bfill则使用后面最近的未被替换的值进行替换。

In [136]:
s = pd.Series(['a', 1, 'b', 2, 1, 1, 'a'])
s

0    a
1    1
2    b
3    2
4    1
5    1
6    a
dtype: object

In [138]:
s.replace([1,2], method="ffill")

0    a
1    a
2    b
3    b
4    b
5    b
6    a
dtype: object

In [139]:
s.replace([1,2], method="bfill")

0    a
1    b
2    b
3    a
4    a
5    a
6    a
dtype: object

**正则替换请使用`str.replace`**

虽然对于`replace`而言可以使用正则替换，但是当前版本下对于`string`类型的正则替换还存在`bug`，因此如有此需求，请选择`str.replace`进行替换操作

#### 逻辑替换
逻辑替换包括了`where`和`mask`

where函数在传入条件为False的对应行进行替换，而mask在传入条件为True的对应行进行替换，当不指定替换值时，替换为缺失值

In [141]:
s = pd.Series([-1, 1.2345, 100, -50])
s

0     -1.0000
1      1.2345
2    100.0000
3    -50.0000
dtype: float64

In [142]:
# 当不指定替换值时，替换为缺失值
s.where(s<0)

0    -1.0
1     NaN
2     NaN
3   -50.0
dtype: float64

In [144]:
# 当不指定替换值时，替换为缺失值
s.mask(s<0)

0         NaN
1      1.2345
2    100.0000
3         NaN
dtype: float64

In [145]:
s.mask(s<0, -999)

0   -999.0000
1      1.2345
2    100.0000
3   -999.0000
dtype: float64

可以直接设置传入条件,传入的条件只需是与被调用的`Series`索引一致的布尔序列即可

In [146]:
# 可以直接设置传入条件
cond = pd.Series([True,False,False,True],index=s.index)# 与被调用的Series索引一致
s.where(cond, -999)

0     -1.0
1   -999.0
2   -999.0
3    -50.0
dtype: float64

### 数值替

数值替换包含了`round, abs, clip`方法，它们分别表示按照给定精度四舍五入、取绝对值和截断

In [147]:
s = pd.Series([-1, 1.2345, 100, -50])

In [148]:
# 保留两位小数
s.round(2)

0     -1.00
1      1.23
2    100.00
3    -50.00
dtype: float64

In [149]:
# 取绝对值
s.abs()

0      1.0000
1      1.2345
2    100.0000
3     50.0000
dtype: float64

In [150]:
# 只取给定范围内的数前两个数分别表示上下截断边界
s.clip(0,2)

0    0.0000
1    1.2345
2    2.0000
3    0.0000
dtype: float64

## 排序函数